### 함수 만들기 
* 제곱함수와 n 제곱함수 만들기

In [91]:
def my_sq(x):
    return x** 2
# x 입력받고 x의 제곱 리턴

def my_exp(x, n):
    return x ** n

In [92]:
my_sq(5)

25

In [93]:
my_exp(5, 4)

625

# 시리즈와 데이터 프레임에 apply 메서드 사용하기

## 1. 시리즈와 apply 메서드

In [94]:
import pandas as pd 
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
#DataFram({'컬럼명':[데이터]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [95]:
df['a']** 2
#컬럼 a 데이터 제곱해보기

0    100
1    400
2    900
Name: a, dtype: int64

* 하나의 파라미터를 넘겨받는 함수 apply

In [96]:
df['new'] = df['a'].apply(my_sq)
#컬럼 a의 각 로우의 데이터들을 my_sq 함수로 넘겨주어 리턴되는 값을 df['new']라는 새 컬럼에 넣어주기
#my_sq는 하나의 패러미터를 전달 받는다. 
df

    a   b  new
0  10  20  100
1  20  30  400
2  30  40  900

* 두개 이상의 파라미터를 넘겨받는 함수 apply

In [97]:
df['new2'] = df['a'].apply(my_exp, n = 2)
#my_exp는 x와 n을 파라미터로 받는 함수, 칼럼 a의 데이터들을 x로 넘겨주고, n=2로 설정해서 apply
df

    a   b  new  new2
0  10  20  100   100
1  20  30  400   400
2  30  40  900   900

In [98]:
df['new3'] = df['a'].apply(my_exp, n = 3)
df

    a   b  new  new2   new3
0  10  20  100   100   1000
1  20  30  400   400   8000
2  30  40  900   900  27000

## 2. 데이터프레임과 apply 메서드

In [99]:
df = pd.DataFrame({'a':[10,20,30], 'b':[20,30,40]})
df

    a   b
0  10  20
1  20  30
2  30  40

In [100]:
def print_me(x):
    print(x)
# 하나의 값을 입력받아 바로 출력해주는 함수

In [101]:
df.apply(print_me, axis = 0)
#print_me라는 함수를 컬럼 기준(axis = 0)으로 df 전체 데이터를 넘겨주어 apply

0    10
1    20
2    30
Name: a, dtype: int64
0    20
1    30
2    40
Name: b, dtype: int64

a    None
b    None
dtype: object

In [102]:
def avg_3(x,y,z):
    return (x+y+z)/3
#3개의 값을 입력받아 평균값을 리턴

In [103]:
print(df.apply(avg_3))
# 인자수가 맞지않아서 에러 발생

TypeError: ("avg_3() missing 2 required positional arguments: 'y' and 'z'", 'occurred at index a')

In [104]:
print(df.apply(avg_3, y =2, z = 3))
#x값을 각 컬럼의 데이터로 적용하고, y, z를 따로 지정해줌

           a          b
0   5.000000   8.333333
1   8.333333  11.666667
2  11.666667  15.000000

In [105]:
def avg_3_apply(col):
    x = col[0]#'a'열 -> df['a'][0]
    y = col[1]# df['a'][1]
    z = col[2]# df['a'][2]
    return (x+y+z)/3
#각 컬럼의 값들을 매개변수로 받고, x,y,z로 초기화하여 리턴
# 컬럼을 받아서, 인덱스 순대로 x, y, z에 저장해주는 구조

In [106]:
df.apply(avg_3_apply)
#각 컬럼들을 매개변수로 넘겨, 인덱스 순대로 데이터를 평균내어 리턴-> 컬럼별로 리턴

a    20.0
b    30.0
dtype: float64

* 컬럼 기준으로 데이터 평균 내기

In [107]:
def avg_3_apply(col):
    sum = 0 
    for item in col:
        sum += item
    return sum / df.shape[0]
#for 문을 이용해, 컬럼의 각 값들을 item으로 받아서 sum 해주고, 행갯수(인덱스갯수)= df.shape[0]으로 받아와서 평균내어 리턴

* 인덱스 기준으로 데이터 평균 내기

In [108]:
def avg_4_apply(col):
    sum = 0 
    for item in col:
        sum += item
    return sum / df.shape[1]
#for 문을 이용해, 한 행의 각 값들을 item으로 받아서 sum 해주고, 열갯수(컬럼갯수)= df.shape[1]으로 받아와서 평균내어 리턴

In [109]:
df['average'] = df.apply(avg_4_apply, axis = 1)
# axis = 0은 기준을 컬럼 기준으로 잡는것, axis = 1은 기준을 행기준, 인덱스 기준으로 잡는 것 
df

    a   b  average
0  10  20     15.0
1  20  30     25.0
2  30  40     35.0

# 데이터 프레임의 누락값을 처리한 다음 apply 메서드 사용하기

## 1. 데이터 프레임의 누락값 처리하기 - 열 방향

In [110]:
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [111]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB
None

* 컬럼별 누락값의 갯수 파악하는 count_missing 함수 만들기

In [112]:
import numpy  as np
def count_missing(vec):
    null_vec = pd.isnull(vec)
    # 넘겨받은 데이터 프레임에 널값들 존재 유무를 True, False 내용으로 채워넣기
    null_count = np.sum(null_vec)
    # True, False 로 채워진 데이터 프레임열 별로 sum 구하기
    return null_count

In [113]:
cmis_col = titanic.apply(count_missing)
#널값이 존재하면 True, 데이터가 존재하면 False로 측정되고, 그에 따라 sum은 True 값만 계산한다.
print(cmis_col)

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

* 각 컬럼의 널값 비율을 출력해주는 함수
* 특정 컬럼의 행 갯수는 데이터프레임.컬럼.size 로 알수 있다 ex) titanic.age.size --> 891

In [114]:
def prop_missing(vec):
    num = count_missing(vec)# 각 컬럼별 null 값의 갯수를 저장
    dem = vec.size # 각 컬럼의 행의 갯수를 저장 
    return num /dem # age 칼럼 경우, 177/891

In [115]:
pmis_col = titanic.apply(prop_missing)
pmis_col

survived       0.000000
pclass         0.000000
sex            0.000000
age            0.198653
sibsp          0.000000
parch          0.000000
fare           0.000000
embarked       0.002245
class          0.000000
who            0.000000
adult_male     0.000000
deck           0.772166
embark_town    0.002245
alive          0.000000
alone          0.000000
dtype: float64

* 각 컬럼 별, null 값이 아닌 비율을 출력 -> 1 - prop_missing(vec)

In [116]:
def prop_complete(vec):
    return 1 - prop_missing(vec)
titanic.apply(prop_complete)

survived       1.000000
pclass         1.000000
sex            1.000000
age            0.801347
sibsp          1.000000
parch          1.000000
fare           1.000000
embarked       0.997755
class          1.000000
who            1.000000
adult_male     1.000000
deck           0.227834
embark_town    0.997755
alive          1.000000
alone          1.000000
dtype: float64

## 데이터 프레임의 누락값 처리하기 -> 행방향

In [117]:
cmis_row = titanic.apply(count_missing, axis = 1)
# 각 행마다 null 값 갯수 리턴
pmis_row = titanic.apply(prop_missing, axis = 1)
# 각 행마다 null 값 비율 리턴 
pcom_row = titanic.apply(prop_complete, axis = 1)
# 각 행마다 null이 아닌 값 비율 리턴 
print(cmis_row.head())
print(pmis_row.head())
print(pcom_row.head())

0    1
1    0
2    1
3    0
4    1
dtype: int64
0    0.066667
1    0.000000
2    0.066667
3    0.000000
4    0.066667
dtype: float64
0    0.933333
1    1.000000
2    0.933333
3    1.000000
4    0.933333
dtype: float64

In [118]:
titanic['num_missing'] = titanic.apply(count_missing, axis =1)
titanic.head()
# 각 행, 인덱스 별 null 의 갯수를 num_missing 컬럼에 저장

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,1
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,1
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,1

In [120]:
titanic[titanic['num_missing'] >= 2].head()
titanic.loc[titanic.num_missing > 1, :].head()
# 각 컬럼별 null 값이 두개이상인 행 출력
# 두가지 방법이 있다~

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,num_missing
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,2
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True,2
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True,2
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True,2
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True,2